
&НаСервере
Процедура ДобавлениеНовыхТоваровНаСервере()
	ГСЧ = Новый ГенераторСлучайныхЧисел; 
	Для Счетчик = 1 По 100 Цикл
		Если Счетчик <= 25 Тогда 
			Группа = Справочники.Номенклатура.НайтиПоНаименованию("Летние");
		ИначеЕсли Счетчик <=50 Тогда     
			Группа = Справочники.Номенклатура.НайтиПоНаименованию("С шипами");
		Иначе     
			Группа = Справочники.Номенклатура.НайтиПоНаименованию("Липучки");
		КонецЕсли;      
		
		НовыйТовар = Справочники.Номенклатура.СоздатьЭлемент();
		НовыйТовар.Наименование = "Товар №" + Счетчик;
		НовыйТовар.Родитель = Группа;
		НовыйТовар.Склад = Справочники.ТорговыеТочки.Оптовый;
		НовыйТовар.ЦенаЗакупочная = ГСЧ.СлучайноеЧисло(500, 2000);
		НовыйТовар.ЦенаПоступления = НовыйТовар.ЦенаЗакупочная * 1.2;
		НовыйТовар.Записать();
	КонецЦикла;      
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхТоваров(Команда)
	ДобавлениеНовыхТоваровНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалениеНовыхТоваровНаСервере()
	Для Счетчик = 1 По 100 Цикл
		СсылкаНаЭлемент = Справочники.Номенклатура.НайтиПоНаименованию("Товар №"+Счетчик+"");
		
		Если НЕ СсылкаНаЭлемент.Пустая() Тогда
			ЭлементПолученный = СсылкаНаЭлемент.ПолучитьОбъект()
			ЭлементПолученный.Удалить(); 
		Иначе 
			Сообщить("Элемент № " + Счетчик + " не найден.");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеНовыхТоваров(Команда)
	УдалениеНовыхТоваровНаСервере();
КонецПроцедуры
