
&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыборФайла = Новый ДиалогВыборФайла(РежимДиалогаВыборФайла.Открытие);
	
	ДиалогВыборФайла.Фильтр = НСтр("ru='CSV файл (*.csv)|*.csv'");
	ДиалогВыборФайла.Заголовок = НСтр("ru='Выберите CSV файл'");
	ДиалогВыборФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыборФайла.Расширение = "csv";
	ДиалогВыборФайла.ИндексФильтра = 0;
	ДиалогВыборФайла.ПолноеИмяФайла = ПутьКФайлу;
	ДиалогВыборФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	Док = Новый ТекстовыйДокумент();
	Док.Прочитать(ПутьКФайлу);
	
	Для А = 1 По Док.КоличествоСтрок() Цикл
		Строка = Док.ПолучитьСтроку(А);
		Массив = СтрРазделить(Строка, ";");
		ВидНоменклатуры = Массив[1];
		Наименование = Массив[0];
		Группа = Массив[2];
		
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.Родитель = Справочники.Номенклатура.НайтиПоНаименованию(Группа);
		НоваяНоменклатура.Наименование = Наименование;   
		Если ВидНоменклатуры = "Товар" Тогда
			НоваяНоменклатура.ВидНоменклатуры  = Перечисления.ВидыНоменклатуры.Товар;
		Иначе          
			НоваяНоменклатура.ВидНоменклатуры  = Перечисления.ВидыНоменклатуры.Услуга;
		КонецЕсли;
		НоваяНоменклатура.Записать();
			
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
