
// ЛЕВОЕ СОЕДИНЕНИЕ (номенклат + ост база, а штрих доп)
"ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
|	ЕСТЬNULL(ШтрихКоды.Штрихкод, ""Нет штрихкода"") КАК Штрихкод
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
|		ПО ТоварыНаСкладахОстатки.Номенклатура = ШтрихКоды.Номенклатура"

"ВЫБРАТЬ
|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
|	ШтрихКоды.Штрихкод КАК Штрихкод,
|	ШтрихКоды.Номенклатура КАК Номенклатура1
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
|		ПО ТоварыНаСкладахОстатки.Номенклатура = ШтрихКоды.Номенклатура"


// ВНУТРЕННЕЕ СОЕДИНЕНИЕ (и штрих, и остаток)
"ВЫБРАТЬ
|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
|	ШтрихКоды.Штрихкод КАК Штрихкод,
|	ШтрихКоды.Номенклатура КАК Номенклатура1
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
|		ПО ТоварыНаСкладахОстатки.Номенклатура = ШтрихКоды.Номенклатура"




// ПОЛНОЕ СОЕДИНЕНИЕ  (любая инфа по всем товарам)
"ВЫБРАТЬ
|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
|	ЕСТЬNULL(ШтрихКоды.Штрихкод, ""Нет штрихкода"") КАК Штрихкод,
|	ШтрихКоды.Номенклатура КАК Номенклатура1
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
|		ПО ТоварыНаСкладахОстатки.Номенклатура = ШтрихКоды.Номенклатура"










