"ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Наименование, 0, 5) КАК Номенклатура,
|	ТоварыНаСкладахОстатки.КоличествоОстаток * 2 КАК КоличествоОстаток1
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|
|УПОРЯДОЧИТЬ ПО
|	КоличествоОстаток УБЫВ"


"ВЫБРАТЬ
|	Контрагенты.Ссылка КАК Ссылка,
|	ДОБАВИТЬКДАТЕ(Контрагенты.ДатаРегистрации,2, ГОД) КАК ДатаРегистрацииПлюсТриДня,
|	МЕСЯЦ(Контрагенты.ДатаРегистрации) КАК МесяцРегистрации,
|	ГОД(Контрагенты.ДатаРегистрации) КАК ГодРегистрации,
|	Контрагенты.ДатаРегистрации КАК ДатаРегистрации1
|ИЗ
|	Справочник.Контрагенты КАК Контрагенты"

"ВЫБРАТЬ
|	ОкладыСотрудников.Сотрудник КАК Сотрудник,
|	ОкладыСотрудников.Оклад КАК Оклад,
|	ОкладыСотрудников.Оклад > 19000
|			И ОкладыСотрудников.Сотрудник = ""Гордеев""
|		ИЛИ ОкладыСотрудников.Оклад <= 18000 КАК Оклад19K
|	СУММА(ОкладыСотрудников.Оклад) Как Оклад
|ИЗ
|	РегистрСведений.ОкладыСотрудников КАК ОкладыСотрудников
|СГРУППИРОВАТЬ ПО 	
|	ОкладыСотрудников.Сотрудник"


"ВЫБРАТЬ
|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Наименование, 0, 5) КАК Номенклатура,
|	ТоварыНаСкладахОстатки.КоличествоОстаток * 2 КАК КоличествоОстаток1,  
|	ТоварыНаСкладахОстатки.КоличествоОстаток МЕЖДУ 15 и 21 Как Между15и20,
|	ТоварыНаСкладахОстатки.Номенклатура.Наименование ПОДОБНО ""Товары"" КАК Поле1
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
|
|УПОРЯДОЧИТЬ ПО
|	КоличествоОстаток УБЫВ"

"ВЫБРАТЬ
|	ПРЕДСТАВЛЕНИЕ(ОкладыСотрудников.Сотрудник) КАК Сотрудник, 
|	СРЕДНЕЕ(ОкладыСотрудников.РазмерОклада) КАК РазмерОклада
|ИЗ
|	РегистрСведений.ОкладыСотрудников КАК ОкладыСотрудников
|
|СГРУППИРОВАТЬ ПО
|	ОкладыСотрудников.Сотрудник"    


"ВЫБРАТЬ
|	ТоварыНаСкладах.Регистратор КАК Регистратор,
|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
|	ТоварыНаСкладах.Количество КАК Количество 
|ИЗ
|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
|ГДЕ
|	ТИПДАННЫХ(ТоварыНаСкладах.Регистратор) = ТИП(Документ.РеализацияТоваров)"










