// Описание
// Объявление переменных
// Пользоват. проц. и функции.
// Системные процедуры и функции.
// Инициализация переменных

// Общий модуль разработан для .............................
// Реализован механизм при котором для любого ..............
// .........................................................

Перем Счетчик;

Процедура СообщениеПриВходеВСистему()
ТекстСообщенияУтро = "Доброе утро!";
ТекстСообщенияДень = "Добрый день!";

Час = Час(ТекущаяДата());

Если Час < 12 и Час > 5 Тогда
	Сообщить (ТекстСообщенияУтро);
ИначеЕсли Час < 16 и Час >= 12 Тогда 
	Сообщить (ТекстСообщенияДень);
КонецЕсли;     

А=1;
Пока А < 1 
	А = А + 1;
	КонецЦикла;

КонецПроцедуры       

Счетчик = 1;



Функция ЭтоТовар(Номенклатура)
	Вернуть Истина;
КонецФункции         



// Параметры от общего к частному (главный → не главный)
Функция ДокументПроведен(ЭтотОбъект,Контрагент,Подписант,НомерВРеестре, Комментарий)
	Вернуть Истина;
КонецФункции




