
&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(НазваниеСправочника, ПутьКФайлу)
	// требует обращения к структуре бд
	// на форме реквизиты. Номер документа. Контрагент. Организация. Если нужно к элементам формы кроме переданных, 
	// но есть в форме, то на сервере, то считается контекст. 
	// без контекста - меньше потребление по памяти
	
	ApplicationExcel = Новый COMОбъект("Excel.Application"); // СоединениеСПриложением, в кавычках с кем соединение
	ОбменСБД = Новый COMОбъект("COMConnector");
	
	ApplicationExcel.Visible = Истина; // запуск в фоне или виден
	ApplicationExcel.Workbooks.Open(ПутьКФайлу);
	
	ApplicationExcel.Sheets(1).Cells(1,1) = "Код";
	ApplicationExcel.Sheets(1).Cells(1,2).Value = "Наименование";	
	
	Если НазваниеСправочника = "Номенклатура" Тогда
		Выборка = Справочники.Номенклатура.Выбрать();
	ИначеЕсли НазваниеСправочника = "Контрагенты" Тогда
		Выборка = Справочники.Контрагенты.Выбрать();
	ИначеЕсли НазваниеСправочника = "ТорговыеТочки" Тогда
		Выборка = Справочники.ТорговыеТочки.Выбрать();
	КонецЕсли;
	
	Сч = 2;
	
	пока Выборка.Следующий() Цикл
		ApplicationExcel.Sheets(1).Cells(Сч, 1) = Выборка.Код;
		ApplicationExcel.Sheets(1).Cells(1, Сч) = Выборка.Наименование;
	
	    Сч = Сч + 1;
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда) 
	// без обращения к структуре бд
	ВыгрузитьНаСервере(ВыборСправочника, ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыборФайла = Новый ДиалогВыборФайла(РежимДиалогаВыборФайла.Открытие);
	
	ДиалогВыборФайла.Фильтр = НСтр("ru='CSV файл (*.csv)|*.csv'");
	ДиалогВыборФайла.Заголовок = НСтр("ru='Выберите CSV файл'");
	ДиалогВыборФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыборФайла.Расширение = "csv";
	ДиалогВыборФайла.ИндексФильтра = 0;
	ДиалогВыборФайла.ПолноеИмяФайла = ПутьКФайлу;
	ДиалогВыборФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры
