

&НаСервере
Функция ПолучитьЗначениеКонстантыРасчетСтоимости()
	ДаНет = Константы.РассчитыватьСтоимостьАвтоматически.Получить();
	Возврат ДаНет;
КонецФункции;


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)  
	РассчитыватьИлиНет = ПолучитьЗначениеКонстантыРасчетСтоимости();     
	
	Если РассчитыватьИлиНет = Истина Тогда     
		Элементы.Товары.ТекущиеДанные.Стоимость = РасчетыКлиентСервер.РасчитатьСтоимость(Элементы.Товары.ТекущиеДанные.ЦенаРеализации, Элементы.Товары.ТекущиеДанные.Количество);
	КонецЕсли;  
	
КонецПроцедуры
                                           